# PointCloudOverrideSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudOverrideSettings Members
PointCloudOverrideSettings Class Constructors Methods Properties See Also
---
The PointCloudOverrideSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PointCloudOverrideSettings()()()() | Constructs a settings object with default values. |
| PointCloudOverrideSettings(PointCloudOverrideSettings) | Constructs a copy of source object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Assign | Assigns values of the source settings to this object. |
| Dispose | Releases all resources used by the PointCloudOverrideSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetModeOverride | Lookup color settings for the given color mode. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Checks if the contents of two settings are equal. |
| SetModeOverride | Sets color settings for the given color mode. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorMode | The current color mode for the PointCloudInstance element or its scan. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Visible | Visibility flag for point cloud scans. |

# See Also
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace